Repository: Bob123a1/CDNSP-GUI
Catalog: locales/*/LC_MESSAGES/language.po
Languages: es

source: Error - Application launched with Python 2, please install Python 3 and delete Python 2
es: Error - La aplicación se ha lanzado con Python 2. Por favor, instala Python 3 y borra Python 2.

source: Error installing {0}, close the application and you can install the module manually by typing in CMD: pip3 install {0}
es: Error al instalar {0}. Cierra la aplicación e instala el módulo manualmente escribiendo en CMD: pip3 install {0}

source: Checking if all required modules are installed!
es: ¡Comprobando si todos los módulos necesarios están instalados!

source: Everything looks good!
es: ¡Parece que todo está bien!

source: Unable to get required files! Check your internet connection
es: ¡Error al descargar los ficheros necesarios! Comprueba tu conexión a Internet.

source: Check if there's extra spaces at the bottom of your titlekeys.txt file! Delete if you do!
es: ¡Comprueba si hay algún espacio extra al final del fichero titlekeys.txt! ¡Bórralos si encuentras alguno!

source: Error!, Missing CDNSP-GUI-config.json file
es: Error - Falta el fichero CDNSP-GUI-config.json

source: Select Download Location
es: Selecciona la localización de las descargas

source: Preload Game Images
es: Precargar imágenes

source: Load Saved Queue
es: Cargar cola guardada

source: Save Queue
es: Guardar cola de descargas

source: Aria2c will be missed
es: Aria2c está deshabilitado

source: DISABLE GAME IMAGE
es: DESACTIVAR IMÁGEN DEL JUEGO

source: Mute All Pop-ups
es: Desactivar todos los pop-ups

source: Disable NSP Repack
es: Desactivar rempaquetado NSP

source: Disable Titlekey check
es: Desactivar comprobación de Titlekey

source: Enable Shorten Name
es: Activar abreviaturas

source: Enable Tinfoil Download
es: Activar descarga Tinfoil

source: Enable SysVer 0 Patch
es: Activar SysVer 0 Patch

source: Save Windows Location and Size
es: Guardar posición y tamaño de la ventana

source: Scan for existing games
es: Buscar juegos ya descargados

source: Base64 Decoder
es: Descodificar Base64

source: Download
es: Descargas

source: Download_bottom
es: Botón_Descarga

source: Options
es: Opciones

source: Tools
es: Herramientas

source: Enable NSP Repack
es: Activar reempaquetado NSP

source: Unmute All Pop-ups
es: Activar pop-ups

source: Enable Titlekey check
es: Activar comprobación de Titlekeys

source: ENABLE GAME IMAGE
es: Activar imágenes

source: Disable Shorten Name
es: Desactivar nombres cortos

source: Disable Tinfoil Download
es: Desactivar descarga Tinfoil

source: Disable SysVer 0 Patch
es: Desactivar SysVer 0 Patch

source: Status:
es: Estado:

source: Game
es: Juego

source: State
es: Estado

source: Game Image:
es: Imagen del Juego:

source: Click the game image above to open the game in the eShop!
es: ¡Haz click en la imagen superior para abrir el juego en la eShop!

source: No Demo
es: Excluir demos

source: Select update version:
es: Selecciona versión de actualización:

source: Download options:
es: Opciones de descarga:

source: Base game + Update + DLC
es: Juego + Actualización + DLC

source: Base game + Update
es: Juego + Actualización

source: Update + DLC
es: Actualización + DLC

source: Base game only
es: Solo juego

source: Update only
es: Solo actualización

source: All DLC
es: Todos los DLCs

source: Add to queue
es: Añadir a cola de descargas

source: Update Titlekeys
es: Actualizar Titlekeys

source: Queue Menu
es: Cola de descargas

source: Remove selected game
es: Eliminar título seleccionado

source: Remove all
es: Eliminar todo

source: Download all
es: Descargar todo

source: Click download all to download all games in queue!
es: ¡Haz click en Descargar todo para comenzar la descarga!

source: Status: Getting game status... Please wait
es: Estado: Analizando juegos descargados... Espera, por favor.

source: Building the current state file... Please wait, this may take some time depending on how many games you have.
es: Actualizando biblioteca... Puede tardar, dependiendo del número de juegos que tengas. Espera, por favor.

source: Error, Current_status.txt doesn't exist
es: Error, el fichero Current_status.txt no existe.

source: Status: Done!
es: Estado: ¡Completado!

source: Downloading game image...
es: Descargando imagen...

source: Titlekey {} is not a 32-digits hexadecimal number!
es: ¡La Titlekey {} no es un número hexadecimal de 32 dígitos!

source: TitleID {} is not a 16-digits hexadecimal number!
es: ¡La Titlekey {} no es un número hexadecimal de 16 dígitos!

source: Starting to download! It will take some time, please be patient. You can check the CMD (command prompt) at the back to see your download progress.
es: La descarga ha comenzado. Puede tardar un poco, ten paciencia. Puedes ver el progreso de la descarga en la ventana del sistema (CMD).

source: Download finished!
es: ¡Descarga finalizada!

source: No updates available for the game
es: No hay actualizaciones para el juego.

source: No updates available for the game, base game downloaded!
es: ¡Juego descargado, no hay actualizaciones disponibles!

source: You didn't choose a location to save the file!
es: ¡No has elegido una localización en la que guardar el archivo!

source: Persistent queue not found, skipping...
es: No se ha encontrado cola de descargas, saltando...

source: Item not found in queue
es: Elemento no encontrado en la cola de descargas.

source: Name for titleID not found in the list
es: El nombre asociado al TitleID no se encuentra en la lista.

source: No game selected to remove!
es: ¡No se ha seleccionado juego que eliminar!

source: Download for all your queued games will now begin! You will be informed once all the download has completed, please wait and be patient!
es: ¡La cola de descarga de juegos compenzará! Se te avisará cuando todas las descargas se completen, ¡por favor, espera y sé paciente!

source: Downloading games...
es: Descargando títulos...

source: No updates available for titleID: {}
es: No hay actualizaciones para el TitleID {}.

source: No updates available for titleID: {}, base game downloaded!
es: ¡Juego descargado correctamente, no hay actualizaciones para el TitleID {}!

source: Download complete!
es: ¡Descarga finalizada!

source: Download Complete!
es: ¡Descarga finalizada!

source: Status: Updating titlekeys
es: Estado: Actualizando Titlekeys.

source: Finished update!
es: ¡Actualización finalizada!

source: Total of new games added: {}
es: Nuevos títulos añadidos: {}

source: Close
es: Cerrar

source: Status: Finished update, There were no new games to update!
es: Estado: Actualización finalizada, ¡no había nuevos juegos para actualizar!

source: Status: Finished update, There were no new games to update! Estado: Actualización finalizada, ¡no había nuevos juegos para actualizar!
es: Estado: Actualización finalizada. Base de datos reconstruida.

source: The database server {} might be down or unavailable
es: El servidor de base de datos {} está caído o no está disponible.

source: Enable Titlekey Check
es: Activar comprobación de Titlekey

source: Disable Titlekey Check
es: Desactivar comprobación de Titlekey

source: It took {} seconds for you to get all images!
es: Se han descargado todas las imágenes en {} segundos

source: Done getting all game images!
es: ¡Se han descargado todas las imágenes!

source: Failed to get version
es: Fallo al identificar la versión

source: No TitleID or TitleID not 16 characters!
es: ¡No se ha encontrado TitleID o no tiene 16 caracteres!

source: Windows size and position saved!
es: ¡Posición y tamaño de la ventana guardados!

source: Search for existing games
es: Buscar juegos ya descargados

source: Browse
es: Explorar

source: Scan
es: Buscar

source: You didn't choose a directory!
es: ¡No seleccionaste un directorio!

source: The chosen directory doesn't exist!
es: ¡El directorio seleccionado no existe!

source: Finished scanning your games!
es: ¡Finalizada la búsqueda de tus juegos!

source: Status: Building the current state file... Please wait, this may take some time depending on how many games you have.
es: Estado: Actualizando biblioteca... Por favor espera, esto puede llevar un rato dependiendo de cuántos juegos tengas.

source: Base64 text:
es: Texto en Base64

source: Decode
es: Descodificar

source: Decoded text:
es: Texto descodificado:

source: Open
es: Abrir

source: Game Info:
es: Información del juego:

source: Game Price:
es: Precio:

source: Game Description:
es: Descripción:

source: Publisher:
es: Editado por:

source: Developer
es: Desarrollado por:

source: Release Date:
es: Fecha de lanzamiento:

source: Category:
es: Categoría:

source: Number of Players:
es: Número de jugadores:

source: Game Info not avaiable for this game at the moment!
es: ¡La información del juego no se encuentra disponible en este momento!

source: About
es: Acerca de...

source: Credits
es: Créditos

source: Language
es: Idioma

source: Please restart the GUI for the new language to apply!
es: ¡Por favor, reinicia la GUI para aplicar el nuevo idioma!

source: No Japanese Game
es: Sin juegos japoneses
